In [3]:
import pandas as pd

In [4]:
pd.read_excel(r"C:\Users\DK INFOTECH\Desktop\dataset.xlsx")

    name  batch  class
0   venu      4     12
1   binu      4     23
2  chinu      1      6

In [5]:
pd.read_csv(r"C:\Users\DK INFOTECH\Desktop\dataset2.csv")

    name  batch  class
0   venu      4     12
1   binu      4     23
2  chinu      1      6
3   kino      4     64
4   fino      8      5